test/wrk2_fission/social_network/qps_1000_15min_orig/output_compose-post-async_5.log
Running 15m test @ http://130.127.133.207:32001
  1 threads and 5 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
------------------------------
Response with status: 502
------------------------------
[response] Body:
{"error":"The action did not return a dictionary or array."}
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02m     3.36m   14.97m    71.42%
    Req/Sec     1.61     13.07   333.00     98.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.45m 
 75.000%    6.44m 
 90.000%   10.21m 
 99.000%   14.49m 
 99.900%   14.94m 
 99.990%   14.98m 
 99.999%   14.98m 
100.000%   14.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   24313.855     0.000000            1         1.00
   76414.975     0.100000          137         1.11
  124518.399     0.200000          274         1.25
  172097.535     0.300000          411         1.43
  219545.599     0.400000          548         1.67
  266862.591     0.500000          684         2.00
  290979.839     0.550000          753         2.22
  314834.943     0.600000          822         2.50
  338690.047     0.650000          890         2.86
  362283.007     0.700000          958         3.33
  386138.111     0.750000         1026         4.00
  404488.191     0.775000         1061         4.44
  427556.863     0.800000         1095         5.00
  451149.823     0.825000         1129         5.71
  475004.927     0.850000         1163         6.67
  542113.791     0.875000         1197         8.00
  579338.239     0.887500         1215         8.89
  614989.823     0.900000         1232        10.00
  650117.119     0.912500         1249        11.43
  685768.703     0.925000         1266        13.33
  720895.999     0.937500         1283        16.00
  739770.367     0.943750         1292        17.78
  756547.583     0.950000         1300        20.00
  775421.951     0.956250         1309        22.86
  791674.879     0.962500         1317        26.67
  810549.247     0.968750         1326        32.00
  818937.855     0.971875         1330        35.56
  827850.751     0.975000         1334        40.00
  838336.511     0.978125         1339        45.71
  846725.119     0.981250         1343        53.33
  854589.439     0.984375         1347        64.00
  858783.743     0.985938         1349        71.11
  862978.047     0.987500         1351        80.00
  869269.503     0.989062         1354        91.43
  873463.807     0.990625         1356       106.67
  877658.111     0.992188         1358       128.00
  879755.263     0.992969         1359       142.22
  881852.415     0.993750         1360       160.00
  883949.567     0.994531         1361       182.86
  886046.719     0.995313         1362       213.33
  888143.871     0.996094         1363       256.00
  890241.023     0.996484         1364       284.44
  890241.023     0.996875         1364       320.00
  892338.175     0.997266         1365       365.71
  892338.175     0.997656         1365       426.67
  894435.327     0.998047         1366       512.00
  894435.327     0.998242         1366       568.89
  894435.327     0.998437         1366       640.00
  896532.479     0.998633         1367       731.43
  896532.479     0.998828         1367       853.33
  896532.479     0.999023         1367      1024.00
  896532.479     0.999121         1367      1137.78
  896532.479     0.999219         1367      1280.00
  898629.631     0.999316         1368      1462.86
  898629.631     1.000000         1368          inf
#[Mean    =   301161.759, StdDeviation   =   201607.410]
#[Max     =   898105.344, Total count    =         1368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.88s 
 75.000%    2.34s 
 90.000%   10.40s 
 99.000%   10.78s 
 99.900%   26.77s 
 99.990%   26.89s 
 99.999%   26.89s 
100.000%   26.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     601.087     0.000000            1         1.00
    1537.023     0.100000          137         1.11
    1631.231     0.200000          274         1.25
    1722.367     0.300000          411         1.43
    1788.927     0.400000          548         1.67
    1880.063     0.500000          684         2.00
    1928.191     0.550000          754         2.22
    1975.295     0.600000          821         2.50
    2018.303     0.650000          892         2.86
    2067.455     0.700000          960         3.33
    2336.767     0.750000         1026         4.00
    3162.111     0.775000         1062         4.44
    3432.447     0.800000         1095         5.00
    3588.095     0.825000         1129         5.71
    3991.551     0.850000         1163         6.67
   10379.263     0.875000         1204         8.00
   10387.455     0.887500         1216         8.89
   10403.839     0.900000         1258        10.00
   10403.839     0.912500         1258        11.43
   10412.031     0.925000         1270        13.33
   10428.415     0.937500         1285        16.00
   10436.607     0.943750         1296        17.78
   10444.799     0.950000         1302        20.00
   10461.183     0.956250         1315        22.86
   10469.375     0.962500         1324        26.67
   10477.567     0.968750         1330        32.00
   10477.567     0.971875         1330        35.56
   10493.951     0.975000         1335        40.00
   10502.143     0.978125         1339        45.71
   10526.719     0.981250         1344        53.33
   10551.295     0.984375         1347        64.00
   10559.487     0.985938         1349        71.11
   10567.679     0.987500         1352        80.00
   10780.671     0.989062         1354        91.43
   10911.743     0.990625         1356       106.67
   11059.199     0.992188         1358       128.00
   14270.463     0.992969         1359       142.22
   14286.847     0.993750         1360       160.00
   14295.039     0.994531         1361       182.86
   14376.959     0.995313         1362       213.33
   14508.031     0.996094         1363       256.00
   24313.855     0.996484         1364       284.44
   24313.855     0.996875         1364       320.00
   24821.759     0.997266         1365       365.71
   24821.759     0.997656         1365       426.67
   26345.471     0.998047         1366       512.00
   26345.471     0.998242         1366       568.89
   26345.471     0.998437         1366       640.00
   26771.455     0.998633         1367       731.43
   26771.455     0.998828         1367       853.33
   26771.455     0.999023         1367      1024.00
   26771.455     0.999121         1367      1137.78
   26771.455     0.999219         1367      1280.00
   26886.143     0.999316         1368      1462.86
   26886.143     1.000000         1368          inf
#[Mean    =     3271.458, StdDeviation   =     3355.106]
#[Max     =    26869.760, Total count    =         1368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1368 requests in 15.00m, 640.26KB read
  Socket errors: connect 0, read 0, write 0, timeout 1011
  Non-2xx or 3xx responses: 7
Requests/sec:      1.52
Transfer/sec:     728.40B